# Aula 3

In [1]:
import pandas as pd

jogadores = pd.read_csv('Players.csv')
jogadores

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state
0,0,Curly Armstrong,180.0,77.0,Indiana University,1918.0,NaN,NaN
1,1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana
2,2,Leo Barnhorst,193.0,86.0,University of Notre Dame,1924.0,NaN,NaN
3,3,Ed Bartels,196.0,88.0,North Carolina State University,1925.0,NaN,NaN
4,4,Ralph Beard,178.0,79.0,University of Kentucky,1927.0,Hardinsburg,Kentucky
...,...,...,...,...,...,...,...,...
3917,3917,Troy Williams,198.0,97.0,South Carolina State University,1969.0,Columbia,South Carolina
3918,3918,Kyle Wiltjer,208.0,108.0,Gonzaga University,1992.0,Portland,Oregon
3919,3919,Stephen Zimmerman,213.0,108.0,"University of Nevada, Las Vegas",1996.0,Hendersonville,Tennessee
3920,3920,Paul Zipser,203.0,97.0,NaN,1994.0,Heidelberg,Germany
3921,3921,Ivica Zubac,216.0,120.0,NaN,1997.0,Mostar,Bosnia and Herzegovina

In [2]:
jogadores.isnull().sum()

Unnamed: 0       0
Player           1
height           1
weight           1
collage        349
born             1
birth_city     470
birth_state    483
dtype: int64

In [3]:
jogadores2 = jogadores

jogadores2.dropna()

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state
1,1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana
4,4,Ralph Beard,178.0,79.0,University of Kentucky,1927.0,Hardinsburg,Kentucky
6,6,Charlie Black,196.0,90.0,University of Kansas,1921.0,Arco,Idaho
7,7,Nelson Bobb,183.0,77.0,Temple University,1924.0,Philadelphia,Pennsylvania
8,8,Jake Bornheimer,196.0,90.0,Muhlenberg College,1927.0,New Brunswick,New Jersey
...,...,...,...,...,...,...,...,...
3915,3915,Okaro White,203.0,92.0,Florida State University,1992.0,Clearwater,Florida
3916,3916,Isaiah Whitehead,193.0,96.0,Seton Hall University,1995.0,Brooklyn,New York
3917,3917,Troy Williams,198.0,97.0,South Carolina State University,1969.0,Columbia,South Carolina
3918,3918,Kyle Wiltjer,208.0,108.0,Gonzaga University,1992.0,Portland,Oregon
3919,3919,Stephen Zimmerman,213.0,108.0,"University of Nevada, Las Vegas",1996.0,Hendersonville,Tennessee

In [4]:
jogadores3 = jogadores
jogadores3

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state
0,0,Curly Armstrong,180.0,77.0,Indiana University,1918.0,NaN,NaN
1,1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana
2,2,Leo Barnhorst,193.0,86.0,University of Notre Dame,1924.0,NaN,NaN
3,3,Ed Bartels,196.0,88.0,North Carolina State University,1925.0,NaN,NaN
4,4,Ralph Beard,178.0,79.0,University of Kentucky,1927.0,Hardinsburg,Kentucky
...,...,...,...,...,...,...,...,...
3917,3917,Troy Williams,198.0,97.0,South Carolina State University,1969.0,Columbia,South Carolina
3918,3918,Kyle Wiltjer,208.0,108.0,Gonzaga University,1992.0,Portland,Oregon
3919,3919,Stephen Zimmerman,213.0,108.0,"University of Nevada, Las Vegas",1996.0,Hendersonville,Tennessee
3920,3920,Paul Zipser,203.0,97.0,NaN,1994.0,Heidelberg,Germany
3921,3921,Ivica Zubac,216.0,120.0,NaN,1997.0,Mostar,Bosnia and Herzegovina

In [5]:
jogadores3['height'].isnull().sum()

1

In [6]:
jogadores3['height'].fillna(jogadores3['height'].mean(), inplace = True)

In [7]:
jogadores3["height"].isnull().sum()

0

In [8]:
jogadores3['weight'].isnull().sum()

1

In [9]:
jogadores3['weight'].fillna(jogadores3['weight'].median(), inplace = True)

In [10]:
jogadores3['weight'].isnull().sum()

0

In [11]:
jogadores3['birth_city'].mode()[0]

'Chicago'

In [12]:
jogadores3['birth_city'].isnull().sum()

470

In [13]:
jogadores3['birth_city'].fillna(jogadores3['birth_city'].mode()[0], inplace = True)

In [14]:
jogadores3['birth_state'].fillna('California', inplace = True)

In [15]:
jogadores3['birth_state'].isnull().sum()

0

# Atividade

In [16]:
atividade = {'nome': ['Alberto', 'Junior', 'Fernando', 'Gustavo', 'Marcos', 'Vinicios', 'Matheus', 'Luan', 'Victor'],
'qtd_gols': [1, 2, 1, 0, 3, None, None, 1, 5],
'funcao': ['atacante', 'zagueiro', 'meia', 'volante', None, None, 'goleiro', None, 'volante'],
'cidade': ['fortaleza', 'beberibe', None, None, 'quixadá', 'fortaleza', 'fortaleza', 'fortaleza', None],
'altura': [1.70, 1.69, 1.72, None, 1.80, 1.80, 1.91, None, 1.67]}

In [17]:
atividade

{'nome': ['Alberto',
  'Junior',
  'Fernando',
  'Gustavo',
  'Marcos',
  'Vinicios',
  'Matheus',
  'Luan',
  'Victor'],
 'qtd_gols': [1, 2, 1, 0, 3, None, None, 1, 5],
 'funcao': ['atacante',
  'zagueiro',
  'meia',
  'volante',
  None,
  None,
  'goleiro',
  None,
  'volante'],
 'cidade': ['fortaleza',
  'beberibe',
  None,
  None,
  'quixadá',
  'fortaleza',
  'fortaleza',
  'fortaleza',
  None],
 'altura': [1.7, 1.69, 1.72, None, 1.8, 1.8, 1.91, None, 1.67]}

In [18]:
atividade_data = pd.DataFrame(atividade)

In [19]:
atividade_data

       nome  qtd_gols    funcao     cidade  altura
0   Alberto       1.0  atacante  fortaleza    1.70
1    Junior       2.0  zagueiro   beberibe    1.69
2  Fernando       1.0      meia       None    1.72
3   Gustavo       0.0   volante       None     NaN
4    Marcos       3.0      None    quixadá    1.80
5  Vinicios       NaN      None  fortaleza    1.80
6   Matheus       NaN   goleiro  fortaleza    1.91
7      Luan       1.0      None  fortaleza     NaN
8    Victor       5.0   volante       None    1.67

In [20]:
atividade_data['qtd_gols'].isnull().sum()

2

In [21]:
atividade_data['qtd_gols'].fillna(atividade_data['qtd_gols'].mean(), inplace = True)

In [22]:
atividade_data

       nome  qtd_gols    funcao     cidade  altura
0   Alberto  1.000000  atacante  fortaleza    1.70
1    Junior  2.000000  zagueiro   beberibe    1.69
2  Fernando  1.000000      meia       None    1.72
3   Gustavo  0.000000   volante       None     NaN
4    Marcos  3.000000      None    quixadá    1.80
5  Vinicios  1.857143      None  fortaleza    1.80
6   Matheus  1.857143   goleiro  fortaleza    1.91
7      Luan  1.000000      None  fortaleza     NaN
8    Victor  5.000000   volante       None    1.67

In [23]:
atividade_data['funcao'].isnull().sum()

3

In [24]:
atividade_data['funcao'].fillna(atividade_data['funcao'].mode()[0], inplace = True)

In [25]:
atividade_data

       nome  qtd_gols    funcao     cidade  altura
0   Alberto  1.000000  atacante  fortaleza    1.70
1    Junior  2.000000  zagueiro   beberibe    1.69
2  Fernando  1.000000      meia       None    1.72
3   Gustavo  0.000000   volante       None     NaN
4    Marcos  3.000000   volante    quixadá    1.80
5  Vinicios  1.857143   volante  fortaleza    1.80
6   Matheus  1.857143   goleiro  fortaleza    1.91
7      Luan  1.000000   volante  fortaleza     NaN
8    Victor  5.000000   volante       None    1.67

In [26]:
atividade_data['cidade'].isnull().sum()

3

In [27]:
atividade_data['cidade'].fillna('fortaleza', inplace = True)

In [28]:
atividade_data

       nome  qtd_gols    funcao     cidade  altura
0   Alberto  1.000000  atacante  fortaleza    1.70
1    Junior  2.000000  zagueiro   beberibe    1.69
2  Fernando  1.000000      meia  fortaleza    1.72
3   Gustavo  0.000000   volante  fortaleza     NaN
4    Marcos  3.000000   volante    quixadá    1.80
5  Vinicios  1.857143   volante  fortaleza    1.80
6   Matheus  1.857143   goleiro  fortaleza    1.91
7      Luan  1.000000   volante  fortaleza     NaN
8    Victor  5.000000   volante  fortaleza    1.67

In [29]:
atividade_data['altura'].isnull().sum()

2

In [30]:
atividade_data['altura'].fillna(atividade_data['altura'].median(), inplace =True)

In [31]:
atividade_data

       nome  qtd_gols    funcao     cidade  altura
0   Alberto  1.000000  atacante  fortaleza    1.70
1    Junior  2.000000  zagueiro   beberibe    1.69
2  Fernando  1.000000      meia  fortaleza    1.72
3   Gustavo  0.000000   volante  fortaleza    1.72
4    Marcos  3.000000   volante    quixadá    1.80
5  Vinicios  1.857143   volante  fortaleza    1.80
6   Matheus  1.857143   goleiro  fortaleza    1.91
7      Luan  1.000000   volante  fortaleza    1.72
8    Victor  5.000000   volante  fortaleza    1.67

In [32]:
atividade_data.loc[(atividade_data['funcao'] == 'volante') & (atividade_data['cidade'] == 'fortaleza')]

       nome  qtd_gols   funcao     cidade  altura
3   Gustavo  0.000000  volante  fortaleza    1.72
5  Vinicios  1.857143  volante  fortaleza    1.80
7      Luan  1.000000  volante  fortaleza    1.72
8    Victor  5.000000  volante  fortaleza    1.67

# Novo dataframe

In [33]:
titanic = pd.read_csv('train.csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [34]:
titanic.loc[titanic['Survived'] == 1].count()

PassengerId    342
Survived       342
Pclass         342
Name           342
Sex            342
Age            290
SibSp          342
Parch          342
Ticket         342
Fare           342
Cabin          136
Embarked       340
dtype: int64

In [35]:
titanic['Age'].isnull().sum()

177

In [36]:
titanic['Age'].fillna(titanic['Age'].median(), inplace =True)

In [37]:
titanic['Embarked'].isnull().sum()

2

In [38]:
titanic['Embarked'].fillna('porto', inplace = True)

In [39]:
titanic['Age'].mean()

29.36158249158249

In [40]:
titanic['Age'].loc[((titanic['Sex'] == 'female') & (titanic['Survived'] == 1))].mean()

28.716738197424892

In [41]:
titanic['Age'].loc[((titanic['Sex'] == 'male') & (titanic['Survived'] == 1))].mean()

27.382293577981653

In [42]:
titanic['Age'].loc[((titanic['Sex'] == 'female') & (titanic['Survived'] == 0))].mean()

25.666666666666668

In [43]:
titanic['Age'].loc[((titanic['Sex'] == 'male') & (titanic['Survived'] == 0))].mean()

30.78311965811966

In [44]:
titanic['Age'].loc[titanic['Survived'] == 0].mean()

30.028233151183972

In [45]:
titanic['Sex'].loc[(titanic['Sex'] == 'male') & (titanic['Survived'] == 0)].count()

468

In [46]:
titanic['Sex'].loc[(titanic['Sex'] == 'female') & (titanic['Survived'] == 0)].count()

81

In [47]:
titanic['Sex'].loc[(titanic['Sex'] == 'male') & (titanic['Survived'] == 1)].count()

109

In [48]:
titanic['Sex'].loc[(titanic['Sex'] == 'female') & (titanic['Survived'] == 1)].count()

233

In [49]:
titanic['Pclass'].loc[(titanic['Survived'] == 1) & (titanic['Pclass'] == 1)].count()

136

In [50]:
titanic['Pclass'].loc[(titanic['Survived'] == 0) & (titanic['Pclass'] == 1)].count()

80

In [51]:
titanic['Pclass'].loc[(titanic['Survived'] == 1) & (titanic['Pclass'] == 2)].count()

87

In [52]:
titanic['Pclass'].loc[(titanic['Survived'] == 0) & (titanic['Pclass'] == 2)].count()

97

In [53]:
titanic['Pclass'].loc[(titanic['Survived'] == 1) & (titanic['Pclass'] == 3)].count()

119

In [54]:
titanic['Pclass'].loc[(titanic['Survived'] == 0) & (titanic['Pclass'] == 3)].count()

372

In [55]:
titanic['Age'].loc[titanic['Pclass'] == 1].mean()

36.81212962962963

In [56]:
titanic['Age'].loc[titanic['Pclass'] == 2].mean()

29.765380434782607

In [57]:
titanic['Age'].loc[titanic['Pclass'] == 3].mean()

25.932627291242362

In [58]:
titanic['Sex'].loc[(titanic['Sex'] == 'male') & (titanic['Pclass'] == 1)].count()

122

In [59]:
titanic['Sex'].loc[(titanic['Sex'] == 'male') & (titanic['Pclass'] == 2)].count()

108

In [60]:
titanic['Sex'].loc[(titanic['Sex'] == 'male') & (titanic['Pclass'] == 3)].count()

347

In [61]:
titanic['Sex'].loc[(titanic['Sex'] == 'female') & (titanic['Pclass'] == 1)].count()

94

In [62]:
titanic['Sex'].loc[(titanic['Sex'] == 'female') & (titanic['Pclass'] == 2)].count()

76

In [63]:
titanic['Sex'].loc[(titanic['Sex'] == 'female') & (titanic['Pclass'] == 3)].count()

144

In [64]:
titanic['Age'].loc[(titanic['Sex'] == 'female') &
                   (titanic['Pclass'] == 1) &
                   (titanic['Survived'] == 1)].mean()

34.252747252747255

In [65]:
titanic['Age'].loc[(titanic['Sex'] == 'female') &
                   (titanic['Pclass'] == 2) &
                   (titanic['Survived'] == 1)].mean()

28.07857142857143

In [66]:
titanic['Age'].loc[(titanic['Sex'] == 'female') &
                   (titanic['Pclass'] == 3) &
                   (titanic['Survived'] == 1)].mean()

22.34027777777778

In [67]:
titanic['Age'].loc[(titanic['Sex'] == 'female') &
                   (titanic['Pclass'] == 1) &
                   (titanic['Survived'] == 0)].mean()

25.666666666666668

In [68]:
titanic['Age'].loc[(titanic['Sex'] == 'female') &
                   (titanic['Pclass'] == 2) &
                   (titanic['Survived'] == 0)].mean()

36.0

In [69]:
titanic['Age'].loc[(titanic['Sex'] == 'female') &
                   (titanic['Pclass'] == 3) &
                   (titanic['Survived'] == 0)].mean()

24.805555555555557

In [70]:
titanic['Age'].loc[titanic['Survived'] == 1].min()

0.42

In [71]:
titanic['Sex'].loc[titanic['Age'] == 0.42]

803    male
Name: Sex, dtype: object

In [72]:
titanic['Pclass'].loc[titanic['Age'] == 0.42]

803    3
Name: Pclass, dtype: int64

In [73]:
titanic['Age'].loc[titanic['Survived'] == 0].min()

1.0

In [74]:
titanic['Sex'].loc[titanic['Age'] == 1.0]

164      male
172    female
183      male
381    female
386      male
788      male
827      male
Name: Sex, dtype: object

In [75]:
titanic['Pclass'].loc[titanic['Age'] == 1.0]

164    3
172    3
183    2
381    3
386    3
788    3
827    2
Name: Pclass, dtype: int64

In [76]:
titanic['Age'].loc[titanic['Survived'] == 1].max()

80.0

In [77]:
titanic['Sex'].loc[titanic['Age'] == 80.0]

630    male
Name: Sex, dtype: object

In [78]:
titanic['Pclass'].loc[titanic['Age'] == 80.0]

630    1
Name: Pclass, dtype: int64

In [85]:
titanic['Age'].loc[titanic['Survived'] == 0].max()

74.0

In [86]:
titanic['Sex'].loc[titanic['Age'] == 74.0]

851    male
Name: Sex, dtype: object

In [81]:
titanic['Pclass'].loc[titanic['Age'] == 74.0]

851    3
Name: Pclass, dtype: int64